---
type: PipingSystemType
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 12
tags: [revit-api, class]
---

# PipingSystemType

`Autodesk.Revit.DB.Plumbing.PipingSystemType` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2012 | `public static PipingSystemType Create ( Document ADoc , MEPSystemClassification systemClassification , string name )` |
| Method | ValidateRiseDropSymbolType | 2012 | `public bool ValidateRiseDropSymbolType ( RiseDropSymbol risedropType )` |
| Property | FlowConversionMethod | 2012 | `public FlowConversionMode FlowConversionMethod { get ; set ; }` |
| Property | FluidTemperature | 2012 | `public double FluidTemperature { get ; set ; }` |
| Property | FluidType | 2012 | `public ElementId FluidType { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SingleLineBendDropType | 2012 | `public RiseDropSymbol SingleLineBendDropType { get ; set ; }` |
| Property | SingleLineBendRiseType | 2012 | `public RiseDropSymbol SingleLineBendRiseType { get ; set ; }` |
| Property | SingleLineJunctionDropType | 2012 | `public RiseDropSymbol SingleLineJunctionDropType { get ; set ; }` |
| Property | SingleLineJunctionRiseType | 2012 | `public RiseDropSymbol SingleLineJunctionRiseType { get ; set ; }` |
| Property | TwoLineDropType | 2012 | `public RiseDropSymbol TwoLineDropType { get ; set ; }` |
| Property | TwoLineRiseType | 2012 | `public RiseDropSymbol TwoLineRiseType { get ; set ; }` |